#+TITLE: How This Blog is Made - [[../index.org][Terminal Tooling]]
#+STARTUP: inlineimages
#+OPTIONS: ^:nil
#+HTML_HEAD: <link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
#+HTML_HEAD: <link rel="stylesheet" href="../css/stylesheet.css" />
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="../images/favicon.ico">
#+PROPERTY: header-args:sh :results output :exports both :cache yes


* Writing
  First, the cornerstone of this whole project is [[https://www.gnu.org/software/emacs/][emacs]]. Emacs is the integrated text
  editing environment that came out decades before IDEs were a thing. It is a text editor
  with a teeny tiny C kernel, and lots and lots of lisp code written to handle all the
  rest. What is unique about emacs is that all that lisp code is open to the user. You
  can call any function, change any variable, write new behavior, augment existing
  behavior using pre or post hooks.

  This means practically /every/ facet of emacs' behavior can be customized, and done so
  using the tools that the editor itself is built with. The line between user and developer
  are so blurred in emacs that it might as well not exist. I use it for writing notes,
  making this blog, writing software, reading [[man:man][man]] pages (very helpful when writing a blog
  dedicated to command line tools!), tracking work and todos, and reading email. There
  are arguably better tools out there for specific tasks, but I view the benefit of having
  all my tools wrapped up in the same application, sharing the same configuration
  language as more valuable.

  For this blog specifically, I use the [[https://protesilaos.com/emacs/denote][denote]] package to jot down an idea for an article.
  Beyond the basics of simply /writing/ text, the venerable [[https://orgmode.org/][org mode]] is my strusty companion.
  You could think of it like Markdown, but far more fully featured. It allows for headings,
  titles, metadata, footnotes, embedded (and executable!) code snippets, links to other
  files, websites, embedded images, and more. Every bit of code on this blog was written
  in an embedded shell block, and actually executed on my computer, with the results
  automatically inserted into the document.

  This org source blog for instance:
  
  #+begin_example
    #+begin_src sh :exports both :results output :dir ~/Documents/notes :cache yes
      find . -iname '*_article*_posix*.org'
    #+end_src
  #+end_example

  gets exported as:[fn:1]

  #+begin_src sh :exports both :results output :dir ~/Documents/notes :cache yes
    find . -iname '*_article*_posix*.org'
  #+end_src

  #+RESULTS[f14f75582e39a150d555bfadcfda05deb814ae48]:
  : ./20231121T100422--xargs__article_blog_posix.org

  Code exporting will be covered in more depth in the [[*Exporting][Exporting]] section. But other than that,
  articles are mostly just starndard org files. I can add an image where I want by just adding
  a link to it in the file. Headers, bold, italics, code, and footnotes are all just native
  features of org files, meaning I don't have to think about how to correctly format something
  for html.

  The last piece of the writing experience that I use is another emacs package called [[https://melpa.org/#/simple-httpd][simple-httpd]].
  This asks for a directory to serve, and starts a local web server exposing the html, css, and
  javascript my export process produces. This gives me a tight feedback loop between writing
  content and seeing the final results in a browser.

